rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "16"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'aaa'
---
  def similar
    @movie = Movie.find(params[:id])

    if @movie.director.to_s.empty?